smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_regdef.h
/** \brief  ATOM Interrupt Group 0 */
typedef struct _Ifx_GTM_ICM_IRQG_9_Bits
{
    Ifx_Strict_32Bit ATOM0_CH0_IRQ:1;       /**< \brief [0:0] ATOM0 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH1_IRQ:1;       /**< \brief [1:1] ATOM0 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH2_IRQ:1;       /**< \brief [2:2] ATOM0 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH3_IRQ:1;       /**< \brief [3:3] ATOM0 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH4_IRQ:1;       /**< \brief [4:4] ATOM0 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH5_IRQ:1;       /**< \brief [5:5] ATOM0 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH6_IRQ:1;       /**< \brief [6:6] ATOM0 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH7_IRQ:1;       /**< \brief [7:7] ATOM0 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH0_IRQ:1;       /**< \brief [8:8] ATOM1 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH1_IRQ:1;       /**< \brief [9:9] ATOM1 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH2_IRQ:1;       /**< \brief [10:10] ATOM1 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH3_IRQ:1;       /**< \brief [11:11] ATOM1 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH4_IRQ:1;       /**< \brief [12:12] ATOM1 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH5_IRQ:1;       /**< \brief [13:13] ATOM1 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH6_IRQ:1;       /**< \brief [14:14] ATOM1 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH7_IRQ:1;       /**< \brief [15:15] ATOM1 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH0_IRQ:1;       /**< \brief [16:16] ATOM2 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH1_IRQ:1;       /**< \brief [17:17] ATOM2 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH2_IRQ:1;       /**< \brief [18:18] ATOM2 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH3_IRQ:1;       /**< \brief [19:19] ATOM2 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH4_IRQ:1;       /**< \brief [20:20] ATOM2 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH5_IRQ:1;       /**< \brief [21:21] ATOM2 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH6_IRQ:1;       /**< \brief [22:22] ATOM2 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH7_IRQ:1;       /**< \brief [23:23] ATOM2 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH0_IRQ:1;       /**< \brief [24:24] ATOM3 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH1_IRQ:1;       /**< \brief [25:25] ATOM3 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH2_IRQ:1;       /**< \brief [26:26] ATOM3 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH3_IRQ:1;       /**< \brief [27:27] ATOM3 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH4_IRQ:1;       /**< \brief [28:28] ATOM3 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH5_IRQ:1;       /**< \brief [29:29] ATOM3 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH6_IRQ:1;       /**< \brief [30:30] ATOM3 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH7_IRQ:1;       /**< \brief [31:31] ATOM3 channel 7 shared interrupt (rh) */
} Ifx_GTM_ICM_IRQG_9_Bits;

/** \brief  ICM Channel Error Interrupt 0 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI0_Bits
{
    Ifx_Strict_32Bit FIFO0_CH0_EIRQ:1;      /**< \brief [0:0] FIFO0 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH1_EIRQ:1;      /**< \brief [1:1] FIFO0 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH2_EIRQ:1;      /**< \brief [2:2] FIFO0 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH3_EIRQ:1;      /**< \brief [3:3] FIFO0 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH4_EIRQ:1;      /**< \brief [4:4] FIFO0 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH5_EIRQ:1;      /**< \brief [5:5] FIFO0 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH6_EIRQ:1;      /**< \brief [6:6] FIFO0 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH7_EIRQ:1;      /**< \brief [7:7] FIFO0 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CEI0_Bits;

/** \brief  ICM Channel Error Interrupt 1 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI1_Bits
{
    Ifx_Strict_32Bit TIM0_CH0_EIRQ:1;       /**< \brief [0:0] TIM0 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH1_EIRQ:1;       /**< \brief [1:1] TIM0 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH2_EIRQ:1;       /**< \brief [2:2] TIM0 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH3_EIRQ:1;       /**< \brief [3:3] TIM0 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH4_EIRQ:1;       /**< \brief [4:4] TIM0 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH5_EIRQ:1;       /**< \brief [5:5] TIM0 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH6_EIRQ:1;       /**< \brief [6:6] TIM0 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH7_EIRQ:1;       /**< \brief [7:7] TIM0 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH0_EIRQ:1;       /**< \brief [8:8] TIM1 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH1_EIRQ:1;       /**< \brief [9:9] TIM1 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH2_EIRQ:1;       /**< \brief [10:10] TIM1 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH3_EIRQ:1;       /**< \brief [11:11] TIM1 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH4_EIRQ:1;       /**< \brief [12:12] TIM1 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH5_EIRQ:1;       /**< \brief [13:13] TIM1 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH6_EIRQ:1;       /**< \brief [14:14] TIM1 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH7_EIRQ:1;       /**< \brief [15:15] TIM1 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH0_EIRQ:1;       /**< \brief [16:16] TIM2 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH1_EIRQ:1;       /**< \brief [17:17] TIM2 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH2_EIRQ:1;       /**< \brief [18:18] TIM2 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH3_EIRQ:1;       /**< \brief [19:19] TIM2 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH4_EIRQ:1;       /**< \brief [20:20] TIM2 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH5_EIRQ:1;       /**< \brief [21:21] TIM2 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH6_EIRQ:1;       /**< \brief [22:22] TIM2 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH7_EIRQ:1;       /**< \brief [23:23] TIM2 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH0_EIRQ:1;       /**< \brief [24:24] TIM3 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH1_EIRQ:1;       /**< \brief [25:25] TIM3 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH2_EIRQ:1;       /**< \brief [26:26] TIM3 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH3_EIRQ:1;       /**< \brief [27:27] TIM3 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH4_EIRQ:1;       /**< \brief [28:28] TIM3 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH5_IRQ:1;        /**< \brief [29:29] TIM3 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH6_EIRQ:1;       /**< \brief [30:30] TIM3 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH7_EIRQ:1;       /**< \brief [31:31] TIM3 channel 7 error interrupt (rh) */
} Ifx_GTM_ICM_IRQG_CEI1_Bits;

/** \brief  ICM Channel Error Interrupt 3 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI3_Bits
{
    Ifx_Strict_32Bit MCS0_CH0_EIRQ:1;       /**< \brief [0:0] MCS0 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH1_EIRQ:1;       /**< \brief [1:1] MCS0 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH2_EIRQ:1;       /**< \brief [2:2] MCS0 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH3_EIRQ:1;       /**< \brief [3:3] MCS0 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH4_EIRQ:1;       /**< \brief [4:4] MCS0 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH5_EIRQ:1;       /**< \brief [5:5] MCS0 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH6_EIRQ:1;       /**< \brief [6:6] MCS0 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH7_EIRQ:1;       /**< \brief [7:7] MCS0 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH0_EIRQ:1;       /**< \brief [8:8] MCS1 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH1_EIRQ:1;       /**< \brief [9:9] MCS1 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH2_EIRQ:1;       /**< \brief [10:10] MCS1 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH3_EIRQ:1;       /**< \brief [11:11] MCS1 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH4_EIRQ:1;       /**< \brief [12:12] MCS1 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH5_EIRQ:1;       /**< \brief [13:13] MCS1 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH6_EIRQ:1;       /**< \brief [14:14] MCS1 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH7_EIRQ:1;       /**< \brief [15:15] MCS1 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH0_EIRQ:1;       /**< \brief [16:16] MCS2 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH1_EIRQ:1;       /**< \brief [17:17] MCS2 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH2_EIRQ:1;       /**< \brief [18:18] MCS2 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH3_EIRQ:1;       /**< \brief [19:19] MCS2 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH4_EIRQ:1;       /**< \brief [20:20] MCS2 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH5_EIRQ:1;       /**< \brief [21:21] MCS2 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH6_EIRQ:1;       /**< \brief [22:22] MCS2 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH7_EIRQ:1;       /**< \brief [23:23] MCS2 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH0_EIRQ:1;       /**< \brief [24:24] MCS3 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH1_EIRQ:1;       /**< \brief [25:25] MCS3 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH2_EIRQ:1;       /**< \brief [26:26] MCS3 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH3_EIRQ:1;       /**< \brief [27:27] MCS3 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH4_EIRQ:1;       /**< \brief [28:28] MCS3 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH5_EIRQ:1;       /**< \brief [29:29] MCS3 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH6_EIRQ:1;       /**< \brief [30:30] MCS3 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH7_EIRQ:1;       /**< \brief [31:31] MCS3 channel 7 error interrupt (rh) */
} Ifx_GTM_ICM_IRQG_CEI3_Bits;

