smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_regdef.h
/** \brief  MCS Channel Program Counter Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_CH_R3_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_MCS_CH_R3;

/** \brief  MCS Channel Program Counter Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_CH_R4_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_MCS_CH_R4;

/** \brief  MCS Channel Program Counter Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_CH_R5_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_MCS_CH_R5;

/** \brief  MCS Channel Program Counter Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_CH_R6_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_MCS_CH_R6;

/** \brief  MCS Channel Program Counter Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_CH_R7_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_MCS_CH_R7;

/** \brief  MCS Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_CTRL_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_MCS_CTRL;

/** \brief  MCS Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_ERR_Bits B;                 /**< \brief Bitfield access */
} Ifx_GTM_MCS_ERR;

/** \brief  MCS Channel Reset Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCS_RST_Bits B;                 /**< \brief Bitfield access */
} Ifx_GTM_MCS_RST;

/** \brief  MCS Interrupt Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCSINTCLR_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_MCSINTCLR;

/** \brief  MCS Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MCSINTSTAT_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_MCSINTSTAT;

/** \brief  Monitor Activity Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MON_ACTIVITY_0_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_MON_ACTIVITY_0;

/** \brief  Monitor Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MON_STATUS_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_MON_STATUS;

/** \brief  MSC Input High Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MSCIN_INHCON_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_MSCIN_INHCON;

/** \brief  MSC Input Low Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MSCIN_INLCON_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_MSCIN_INLCON;

/** \brief  MSC Set Control 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MSCSET_CON0_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_MSCSET_CON0;

/** \brief  MSC Set Control 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MSCSET_CON1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_MSCSET_CON1;

/** \brief  MSC Set Control 2 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MSCSET_CON2_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_MSCSET_CON2;

/** \brief  MSC Set Control 3 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_MSCSET_CON3_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_MSCSET_CON3;

/** \brief  OCDS Control and Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_OCS_Bits B;                     /**< \brief Bitfield access */
} Ifx_GTM_OCS;

/** \brief  OCDS Debug Access Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ODA_Bits B;                     /**< \brief Bitfield access */
} Ifx_GTM_ODA;

/** \brief  OCDS TBU0 Trigger Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_OTBU0T_Bits B;                  /**< \brief Bitfield access */
} Ifx_GTM_OTBU0T;

/** \brief  OCDS TBU1 Trigger Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_OTBU1T_Bits B;                  /**< \brief Bitfield access */
} Ifx_GTM_OTBU1T;

